Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/buying_a_home/costs_of_buying_a_home.html.txt.tmx
Source language: en
Languages: ga

source: Costs of buying a home
ga: Na costais a bhaineann le teach a cheannach

source: As well as paying the mortgage, there are other costs involved in buying a home
ga: Tá costais eile a bhaineann le ceannacht tí seachas an morgáiste

source: These can be significant, so it is important to be aware of them before proceeding with the purchase.This document outlines the main costs involved
ga: Is féidir leo seo a bheith trom go leor, mar sin tá sé tábhachtach iad a bheith curtha san áireamh roimh dhul ar aghaidh le ceannacht tí

source: The amount of money that you can get as a mortgage loan is governed by Central Bank lending limits, so you will need to pay the balance of the purchase price as a deposit
ga: De réir Rialacháin de chuid an Bhainc Cheannais, tá teorannacha ar an méid gur féidir a fháil mar iasacht mhorgáiste. Is gá iarmhéid an phraghais a íoc mar éarlais

source: In general, you will need a deposit of at least 10% of the purchase price - and possibly more, depending on your situation
ga: De ghnáth, bíonn ar cheannaitheoirí ar a laghad 10% den phraghas, nó fiú níos mó, a íoc mar éarlais

source: See Taking out a mortgage for details of these rules
ga: Féach Morgáiste a fháil

source: If the mortgage is from a local authority, the deposit may be as low as 3% of the purchase price
ga: Más morgáiste ón údarás áitiúil atá i gceist, d'fhéadfadh an t-éarlais a bheith chomh híseal le 3% den phraghas

source: These may include an application fee, as well as the costs of the lender's survey and searches. There may also be fees for mortgage loan costs and an indemnity bond to ensure that if the lender has to repossess the property it won't make a loss
ga: D'fhéadfadh na nithe seo a leanas a bheith san áireamh anseo: táille iarratais; suirbhé an iasachtóra; cuardaithe; costais iasachta morgáiste agus banna slánaithe chun a chinntiú nach mbeidh caillteanas dhá dhéanamh ag an iasachtóir má bhíonn air athsheilbh a thógáil ar a áitreabh

source: There is no fixed rate of charges for legal fees
ga: Níl aon ráta seasta muirear ann le haghaidh táillí dlí

source: Under Section 4 of the Competition Act 2002, there is no fixed percentage or level of fees
ga: Faoi Alt 4 den Acht Iomaíochta, 2002, níl aon chéatadán nó leibhéal seasta táillí ann

source: Rather, solicitors can offer competitive rates for conveyancing work - the legal work associated with buying a home
ga: Seachas sin, is féidir le haturnaetha rátaí iomaíocha a thairiscint le haghaidh obair thíolactha - an obair dlí a bhaineann le teach a cheannach

source: Some may charge a flat fee and some may charge a percentage of the purchase price
ga: Féadfaidh siad táille sheasta a ghearradh ort nó céatadán den phraghas ceannaigh

source: You can shop around to find a solicitor who will charge the lowest possible fee
ga: Is féidir roinnt meastachán a fháil sula ndéanann tú cinneadh faoi ghnólacht dlí

source: There may be other costs associated with the legal process, including Land Registry fees and fees for legal searches
ga: Féadfaidh costais eile a bheith ann a bhaineann leis an bpróiseas dlí lena n-áirítear táillí na clárlainne talún agus táillí cuardaigh dlí

source: Value Added Tax is also payable on the legal fees
ga: Bíonn CBL iníoctha ar na táillí dlí freisin

source: This is the fee for your own survey, which is different from the survey carried out by the lending agency
ga: Tá an suirbhé seo difriúil ón suirbhé a dhéanann an t-iasachtóir

source: The cost can vary considerably
ga: Bíonn difear an-mhór sna costais

source: Mortgage protection insurance is designed to pay the balance of your mortgage if you die before the loan is fully repaid
ga: Tá árachas chosaint mhorgáiste deartha le fuílleach do mhorgáiste a íoc má fhaigheann tú bás sula n-aisíoctar an iasacht go hiomlán

source: In general, lenders are legally obliged to make sure that you have adequate mortgage protection cover when you take out a home loan, although you do not have to arrange this insurance through them
ga: Go ginearálta, ní mór d’iasachtóirí a chinntiú go bhfuil cosaint mhorgáiste leordhóthanach agat nuair a fhaigheann tú iasacht le teach a cheannach, ach ní gá gurb iad sin a shocróidh an t-árachas duit

source: Premiums vary but always reduce over the life of the loan as the amount of the loan reduces
ga: Ní mar a chéile préimheanna chuile chomhlacht ach tagann laghdú orthu i gcónaí thar théarma na hiasachta de réir mar a laghdaítear méid na hiasachta

source: Local authorities run their own Local Authorities Mortgage Protection Plan and people borrowing under the Local Authorities House Purchase Loan scheme must take out insurance through this scheme
ga: Ritheann na húdaráis áitiúla plean dá gcuid féin (Plean na nÚdarás Áitiúil um Chosaint Mhorgáiste) agus ní mór don té a fhaigheann iasacht faoi Scéim Iasachta na nÚdarás Áitiúil le Teach a Cheannach árachas a fháil tríd an scéim sin

source: Most lenders will also insist that you take out adequate home insurance to protect your home in the event of fire or other damage
ga: Áitíonn formhór na n-iasachtóirí freisin go bhfaighfeá dóthain árachas bhaile le do theach a chosaint i gcás tine nó damáiste éigin eile

source: You are not obliged to purchase home insurance from your lender
ga: Níl ort árachas a cheannach ó d’iasachtóir

source: Stamp duty is based on the value of the property transaction
ga: Is cáin í an stampdhleacht a bhíonn le n-íoc de réir luach na ngnóthaí
